package application;

/**
 * Created by Денис on 11.03.14.
 */
public class TestApp {
    public static void main(String arg[]){

        //Dialog d = new Dialog();
        //d.Show();


/*
        //
        // синтаксический конструктор!
        пишем например (и в процессе на экране выбираем контекст того что пишем - состояние переход или токен)

        например

                на \выбрали состояние\ станцию \ выбрали объект или создали объект состояния\ прибывает \ выбрали токен или создали \ поезд \ указали токен\
        * это будет значить что состояние порождает токен. если б написали поезд прибывает на станцию то это бы тоже самое. фиктивные сосотяние в начале сети.

        потом еще можем дальше писать И это специальный символ означает что новый токен в то же состояние

                когда с состоянием определились то дальше пишем переход
                когда указываем токен то токен сам может преобразоваться в полный текст. перечислив все поля. можно оставить просто название.

                переход пишем. из\ от \ и прочие специальные слова при условии что выбран контекст перехода то указываем состояние первое потом второе и потом условие перечисляем.

        чтото типа того. чтоб был тект. с специальными вставками.

              //
*/
    }



}
